app/Controllers/Komik.php

INSERT INTO `komik` (`judul`, `slug`, `penulis`, `penerbit`, `sampul`) VALUES ('haikyuu', 'haikyuu', 'bayu winata', 'gramedia', '1719308160_e97a09a20164b5228d8b.jpeg')
---
                                $filsampul->move("img", $namaSampul);
            }
        $slug = url_title($this->request->getVar("judul"), "-", true);
        $this->komikModel->save([
        "judul" =>$this->request->getVar("judul"),
        "slug" => $slug,
        "penulis" =>$this->request->getVar("penulis"),
        "penerbit" =>$this->request->getVar("penerbit"),
        "sampul" =>$namaSampul
      ]);

SELECT *
FROM `komik`
WHERE `komik`.`id` = '41'
DELETE FROM `komik`
WHERE `id` IN ('41')
---
public function delete($id)
{
    log_message('info', 'Memulai proses hapus untuk ID: ' . $id);

    // cek apakah komik dengan id tersebut ada
    $komik = $this->komikModel->find($id);
    if ($komik) {
        log_message('info', 'Komik ditemukan: ' . json_encode($komik));

        // cek apakah sampul bukan gambar default
        if ($komik['sampul'] != 'default.jpg') {
            log_message('info', 'Sampul bukan default, akan dihapus: ' . $komik['sampul']);

            // hapus gambar
            if (file_exists('img/' . $komik['sampul'])) {
                unlink('img/' . $komik['sampul']);
            } else {
                log_message('error', 'File sampul tidak ditemukan: img/' . $komik['sampul']);
            }
        }

        // hapus data komik
        $this->komikModel->delete($id);